app/controllers/cars_controller.rb

  def show
    @car = Car.find_by(id: params[:id])
---
SELECT  "cars".* FROM "cars"  WHERE "cars"."id" = 4 LIMIT 1