app/controllers/reports_controller.rb

  def show # show is a get request
    @report = Report.find_by(id: params[:id])
---
SELECT  "reports".* FROM "reports"  WHERE "reports"."id" = 1 LIMIT 1

  def create # a post request, so never render inside
    unless @car = Car.find_by(state: params[:car][:state], plate: params[:plate].upcase)
      @car = Car.create!(state: params[:car][:state], plate: params[:plate].upcase)
    end

    @car.reports << @report = Report.create(car_id: @car.id, user_id: current_user.id, title: params[:title], text: params[:text])
---
SELECT  "cars".* FROM "cars"  WHERE "cars"."state" = 'WY' AND "cars"."plate" = '345FDFAD' LIMIT 1
INSERT INTO "cars" ("created_at", "plate", "state", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2015-07-28 22:55:15.108932"], ["plate", "345FDFAD"], ["state", "WY"], ["updated_at", "2015-07-28 22:55:15.108932"]]
INSERT INTO "reports" ("car_id", "created_at", "text", "title", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["car_id", 3], ["created_at", "2015-07-28 23:38:45.611910"], ["text", "THIS IS THE TEXT FIELD"], ["title", "asdfasdfas"], ["updated_at", "2015-07-28 23:38:45.611910"], ["user_id", 13]]