app/controllers/users_controller.rb

  def create
    @user = User.new(username: params[:user][:username])
    @user.password = params[:user][:password]
    if @user.save!
---
INSERT INTO "users" ("created_at", "password_hash", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2015-07-28 19:05:19.298866"], ["password_hash", "$2a$10$tH04XYopbiD7TCiTwrTPxuragTcH0iLkGe9H6yS5cljJDoi1UPmnK"], ["updated_at", "2015-07-28 19:05:19.298866"]]